In [1]:
import pandas as pd
df=pd.read_excel('score.xlsx',index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고  197   90    5  100  95  85      python
2번    강태원  구로고  184   40   35   50  55  25        Java
3번    강호림  구로고  168   80   75   70  80  75  Javascript
4번    김수찬  구로고  187   40   60   70  75  80         NaN
5번    김재욱  구로고  188   15   20   10  35  10         NaN
6번    박동현  구로고  202   80  100   95  85  80           C
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
8번    승근열  단지고  190  100   85   90  95  95          C#

## 검색부분

In [2]:
df['이름']

지원번호
1번    강나래
2번    강태원
3번    강호림
4번    김수찬
5번    김재욱
6번    박동현
7번    박혜정
8번    승근열
Name: 이름, dtype: object

## 단어 검색
### startswith('김')
### contains

In [7]:
# 김씨만 출력
filt=df['이름'].str.startswith('김')
filt
df.loc[filt]

       이름   학교    키  국어  영어  수학  과학  사회 SW특기
지원번호
4번    김수찬  구로고  187  40  60  70  75  80  NaN
5번    김재욱  구로고  188  15  20  10  35  10  NaN

In [29]:
data={'idx':['안녕하세요','반갑습니다','고마워요다음에봐요']}
df_str=pd.DataFrame(data)
df_str

# 문자열 자르기
df_str['idx']
df_str['idx'].str.slice(1,3) #둘다 같다
# df_str['idx'].map(lambda x:x[1:3]) #map뒤에는 함수가 올수있다.lambda:익명함수

0    녕하
1    갑습
2    마워
Name: idx, dtype: object

In [19]:
a=[1.2 , 2.5 , 3.7 , 4.6]
for i in range(4):
    a[i]=int(a[i])
a

[1, 2, 3, 4]

In [23]:
a=[1.2 , 2.5 , 3.7 , 4.6]
a=list(map(int,a))
a

[1, 2, 3, 4]

In [32]:
#split : 쉼표로 문자열 분리
a_list=['데이터,분석가','영희,철수,바둑이','국어,영어,수학,과학,사회']
data={'d_split':a_list}
df_str=pd.DataFrame(data)
df_str['d_split'].str.split(',') #배열로 분리되어 리턴

0              [데이터, 분석가]
1           [영희, 철수, 바둑이]
2    [국어, 영어, 수학, 과학, 사회]
Name: d_split, dtype: object

In [38]:
#replace : 내용을 변경
a_list=['데이터,분석가','영희,철수,바둑이','국어,영어,수학,과학,사회']
data={'d_split':a_list}
df_str=pd.DataFrame(data)
df_str['d_split'].str.replace('데이터','파이썬')

0           파이썬,분석가
1         영희,철수,바둑이
2    국어,영어,수학,과학,사회
Name: d_split, dtype: object

In [47]:
# contains('태') 글자를 포함된거 찾아줘
filt=df['이름'].str.contains('태')
df[filt]

       이름   학교    키  국어  영어  수학  과학  사회  SW특기
지원번호
2번    강태원  구로고  184  40  35  50  55  25  Java

In [52]:
a='abcdefg.xlsx'
b='aaaaaaaaaa.csv'
a.index('.')
a[a.index('.')+1:]
# b.index('.')

'xlsx'

In [39]:
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고  197   90    5  100  95  85      python
2번    강태원  구로고  184   40   35   50  55  25        Java
3번    강호림  구로고  168   80   75   70  80  75  Javascript
4번    김수찬  구로고  187   40   60   70  75  80         NaN
5번    김재욱  구로고  188   15   20   10  35  10         NaN
6번    박동현  구로고  202   80  100   95  85  80           C
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
8번    승근열  단지고  190  100   85   90  95  95          C#